app/Controllers/Admin/Addcourses.php

    public function add($id): string
    {
        $breadcumbs = [
            'Data' => [
                'active' => false,
                'href' => '#',
            ],
            'Tambah Mata kuliah' => [
                'active' => true,
                'href' => '/admin/addcourses',
            ]
        ];

        $coursesModel = new CoursesModel();
        $courses = $coursesModel->findAll();

        $studiesModel = new StudiesModel();
        $studies = $studiesModel->findAll();

        $userModel = new UserModel();
        $users = $userModel->find($id);
---
SELECT *
FROM `courses`
SELECT *
FROM `users`
WHERE `users`.`id` = '4'