app/Controllers/Member/Absence.php

SELECT *
FROM `users`
WHERE `id` = '2'
 LIMIT 1
---
    public function take_photo()
    {
        // file name based on email
        $user = new UserModel();
        $user = $user->where('id', session('user')['id'])->first();