app/Controllers/Member/Absence.php

SELECT *
FROM `courses_users`
WHERE `id` = '1'
 LIMIT 1
INSERT INTO `absence` (`user_id`, `course_id`, `date`, `reason`, `courses_users_id`, `created_at`, `updated_at`) VALUES ('2', '1', '2024-05-24', 'Presensi', '1', '2024-05-24 21:28:41', '2024-05-24 21:28:41')
---
    public function presence()
    {
        $courses_user = new CoursesUsersModel();
        $courses_user = $courses_user->where('id', session('absence_id'))->first();


        $absence = new AbsenceModel();
        $absence->insert([
            'user_id' => session('user')['id'],
            'course_id' => $courses_user['course_id'],
            'date' => date('Y-m-d'),
            'reason' => 'Presensi',
            'courses_users_id' => session('absence_id'),
            'created_at' => date('Y-m-d H:i:s'),
            'updated_at' => date('Y-m-d H:i:s'),
        ]);