app/Controllers/Member/Course.php

SELECT *
FROM `absence`
WHERE `courses_users_id` = '6'
 LIMIT 1
---
    private function isEnable($courses_users_id, $scheduled_at, $expired_at)
    {
        // indonesia timezone
        date_default_timezone_set('Asia/Jakarta');
        $now = date('Y-m-d H:i:s');

        $absence = new AbsenceModel();
        $data = $absence->where('courses_users_id', $courses_users_id)->first();