app/Filters/AuthMember.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $session = session()->get('user');

        if (!$session) {
            return redirect()->to('/');
        } else {
            // check photo
            $user = new \App\Models\UserModel();
            $user = $user->find($session['id']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'